app/controllers/dashboard_controller.rb

  def resource

    flash[:filter] = false
    flash[:issuelastbeforemonth] = ''
    flash[:donuttitle_outer] = ''
    flash[:issuelastmonth] = ''
    flash[:donuttitle_inner] = ''
    flash[:issuelast2monthsback] = ''
    flash[:donuttitle_outer_most] = ''

    @project_details = Projectdetail.find(:all,:order => 'month')

    currentmonth = DateTime.now.month;
    currentyear = DateTime.now.year;

    @project_details.each do |projdetail|
---
SELECT * FROM "projectdetails" ORDER BY month

    end


    material_actuals = MaterialActual.find(:all, :conditions => "projid = 1")
---
SELECT * FROM "material_actuals" WHERE (projid = 1)