app/controllers/materials_controller.rb

  def index
    project_id = session[:project_id]
    filtercriteria = ''
    unless params[:filtercriteria].nil?
      project_id = 1
      session[:project_id] = "1"
      if params[:filtercriteria].to_s == "Crusher Metso"
        filtercriteria = 'Crusher-Metso'
      elsif params[:filtercriteria].to_s == "Wet Plant"
        filtercriteria = 'Wet Mix'
      else
        filtercriteria = params[:filtercriteria].to_s
      end
    end
    if !project_id.nil?
      unless params[:filtercriteria].nil?
        @materials = Material.find(:all,:conditions => "projid = #{project_id} and description like '%" + filtercriteria + "%'" )
      else
        @materials = Material.find(:all,:conditions => "projid = #{project_id}")
      end
       @material = Material.new
    else
       @materials = Array.new
       @material = nil
       session[:project_id] = nil
    end
    @projectlist = Project.find(:all, :order => "name")
---
SELECT * FROM "materials" WHERE (projid = 1 and description like '%HotMix Plant%')
SELECT * FROM "projects" WHERE (id = 1)

  def edit
    @material = Material.find(params[:id])
---
SELECT * FROM "materials" WHERE ("materials"."id" = 1)

  def create
    @material = Material.new(params[:material])
    unless session[:project_id].nil?
      @material.projid = session[:project_id]
    end
    respond_to do |format|
      if @material.save
---
INSERT INTO "materials" ("assetnumber", "description", "capacity", "ifc", "scheduledhour", "unavailablehour", "utilizedhours", "theoreticaloutput", "actualoutput", "theoreticalconsumption", "actualconsumption", "projid", "created_at", "updated_at") VALUES('34534', 'ertert', 'rtert', 34.0, 43.0, 343.0, 34.0, 34.0, 34.0, 34.0, 34.0, 1, '2010-11-13 07:14:19.502535', '2010-11-13 07:14:19.502535') RETURNING "id"
INSERT INTO "projects" ("name", "location", "created_at", "updated_at") VALUES('Sew NH26', 'Trichy', '2010-11-13 07:08:18.264873', '2010-11-13 07:08:18.264873') RETURNING "id"

  def update
    @material = Material.find(params[:id])
    unless session[:project_id].nil?
      @material.projid = session[:project_id]
    end
    respond_to do |format|
      if @material.update_attributes(params[:material])
---
SELECT * FROM "materials" WHERE ("materials"."id" = 1)
UPDATE "materials" SET "actualoutput" = 345.0, "updated_at" = '2010-11-12 11:56:15.922130' WHERE "id" = 1