app/controllers/material_actuals_controller.rb

SELECT * FROM "material_actuals" WHERE (projid = 1)
SELECT "projects".id FROM "projects" WHERE ("projects"."name" = 'Sew NH26') LIMIT 1
---
  def index
    project_id = session[:project_id]
    unless project_id.nil?
        @material_actuals = MaterialActual.find(:all,:conditions => "projid = #{project_id}")
        @material_actual = MaterialActual.new
    else
       @material_actuals = Array.new
       @material_actual = nil
       session[:project_id] = nil
    end
    @projectlist = Project.find(:all, :order => "name")

SELECT * FROM "material_actuals" WHERE ("material_actuals"."id" = 1)
---
  def edit
    @material_actual = MaterialActual.find(params[:id])

SELECT * FROM "material_actuals" WHERE ("material_actuals"."id" = 4)
---
  def update
    @material_actual = MaterialActual.find(params[:id])