app/controllers/projectdetails_controller.rb

  def index
    project_id = session[:project_id]
    unless project_id.nil?
        @projectdetails = Projectdetail.find(:all,:order => "month",:conditions => "projid = #{project_id}")
        @projectdetail = Projectdetail.new
        session[:project_id] = project_id
        @currentyear = Time.new.year - 5
    else
        @projectdetails = Array.new
        @projectdetail = nil
        session[:project_id] = nil
    end
    @projectlist = Project.find(:all, :order => "name")
---
SELECT * FROM "projectdetails" WHERE (projid = 1) ORDER BY month
SELECT "projects".id FROM "projects" WHERE ("projects"."name" = 'Sew NH26') LIMIT 1

  def edit
    @projectdetail = Projectdetail.find(params[:id])
---
SELECT * FROM "projectdetails" WHERE ("projectdetails"."id" = 1)

  def create
    @projectdetail = Projectdetail.new(params[:projectdetail])
    unless session[:project_id].nil? or session[:project_id].empty?
      @projectdetail.projid = session[:project_id]
    end
    @currentyear = Time.new.year - 5
    respond_to do |format|
      if @projectdetail.save
---
INSERT INTO "projectdetails" ("month", "OriginalBaselinePlan", "PlannedValue", "LreSite", "LrePmc", "Ac", "PercentageProgress", "Action", "created_at", "updated_at") VALUES('2010-11-09', 26.0, 54.0, 54.0, 54.0, 54.0, 54.0, NULL, '2010-11-09 05:28:57.952752', '2010-11-09 05:28:57.952752') RETURNING "id"

  def update
    @projectdetail = Projectdetail.find(params[:id])
    unless session[:project_id].nil? or session[:project_id].empty?
      @projectdetail.projid = session[:project_id]
    end
    @currentyear = Time.new.year - 5
    respond_to do |format|
      if @projectdetail.update_attributes(params[:projectdetail])
---
SELECT * FROM "projectdetails" WHERE ("projectdetails"."id" = 2)
UPDATE "projectdetails" SET "InternalIssues" = 0, "ExternalIssues" = 2, "updated_at" = '2010-11-13 14:17:46.863894' WHERE "id" = 32