app/controllers/projects_controller.rb

  def create
    @project = Project.new(params[:project])
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "location", "created_at", "updated_at") VALUES('Project1', 'chennai', '2010-11-09 07:21:43.401543', '2010-11-09 07:21:43.401543') RETURNING "id"

  def update
    @project = Project.find(params[:id])
    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 2)
UPDATE "projects" SET "location" = 'trichy', "updated_at" = '2010-11-09 07:24:29.013015' WHERE "id" = 2